#include"PrintFunction.h"

void PrintMenu()
{
	cout << "----------------个人通信录管理系统-----------------" << endl;
	cout << "----------------1.录入联系人个人信息----------------" << endl;
	cout << "----------------2.修改联系人个人信息----------------" << endl;
	cout << "----------------3.删除联系人个人信息----------------" << endl;
	cout << "----------------4.查询联系人个人信息----------------" << endl;
	cout << "----------------5.显示联系人个人信息----------------" << endl;
	cout << "----------------6.清空通讯录个人信息----------------" << endl;
	cout << "----------0.退出个人通讯录[选择退出自动保存]--------" << endl;
}

void SmallPrintMenu()
{
	cout << "请选择您的显示方式：" << endl;
	cout << "1.按照姓名排序显示" << endl;
	cout << "2.按照出生日期排序显示" << endl;
	cout << "3.按照给定月份出生显示" << endl;
}